{
  "exam_code": "AZ-900",
  "questions": [
    {
      "type": "yes_no",
      "skill_area": "Describe Azure storage services",
      "question": "Does Azure Blob Storage primarily store relational data?",
      "expected_answer": "No",
      "purpose": "Binary Assessment"
    },
    {
      "type": "yes_no",
      "skill_area": "Describe the differences between categories of cloud services",
      "question": "Is Platform as a Service (PaaS) responsible for managing the underlying operating system and hardware for you?",
      "expected_answer": "Yes",
      "purpose": "Binary Assessment"
    },
    {
      "type": "qualitative",
      "skill_area": "Describe Azure compute and networking services",
      "question": "Explain the key differences between Azure Virtual Machines and Azure Container Instances, and when you would choose one over the other.",
      "purpose": "Scaled Assessment",
      "scoring_criteria": [
        "Describe Azure Virtual Machines as highly configurable servers requiring OS management.",
        "Describe Azure Container Instances as serverless, managed Docker containers.",
        "Highlight management overhead differences (VMs require patching and maintenance, ACI does not).",
        "Discuss typical use cases (persistent workloads for VMs, lightweight/ephemeral workloads for ACI).",
        "Mention scalability and startup time differences."
      ]
    },
    {
      "type": "qualitative",
      "skill_area": "Describe cost management in Azure",
      "question": "Discuss how the Azure Pricing Calculator and Azure Cost Management tools help organizations control and forecast cloud spending.",
      "purpose": "Scaled Assessment",
      "scoring_criteria": [
        "Explain the purpose of the Azure Pricing Calculator for estimating costs before deployment.",
        "Describe how Azure Cost Management provides visibility into actual spending.",
        "Discuss the role of budgets and alerts in Azure Cost Management.",
        "Mention exporting and sharing estimates with stakeholders.",
        "Explain how these tools support planning and ongoing cost optimization."
      ]
    }
  ]
}